0.orig/GLeaf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      GLeaf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform 0;
    }

    ceiling
    {
        type            calculated;
        value           uniform 0;
    }

    fixedWalls
    {
        type            calculated;
        value           uniform 0;
    }
	
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
	
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
