0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
Uinlet          (0.8 0 0);
internalField   uniform (0.8 0 0);

boundaryField
{
    floor
    {
        type            noSlip;
    }

    ceiling
    {
        type            noSlip; // zeroGradient; 
    }

    fixedWalls
    {
        type            noSlip; // zeroGradient;
    }
	
	inlet
    {
        type            fixedValue;
		value           uniform $Uinlet;
    }
	
	outlet
	{
		type            inletOutlet;
        inletValue      uniform $Uinlet;
        value           $internalField;
	}

}


// ************************************************************************* //