0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    floor
	{
		type nutkWallFunction;
		value uniform 1e-5;
	}

	ceiling
	{
		type zeroGradient;
	}

	fixedWalls
	{
		type nutkWallFunction;
		value uniform 1e-5;
	}

	inlet
	{
		type fixedValue;
		value uniform 1e-5;
	}

	outlet
	{
		type zeroGradient;
	}

}


// ************************************************************************* //