0.orig/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.225;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform 1.225;
    }

    ceiling
    {
        type            calculated;
        value           uniform 1.225;
    }

    fixedWalls
    {
        type            calculated;
        value           uniform 1.225;
    }

    inlet
    {
        type            calculated;
        value           uniform 1.225;
    }

    outlet
    {
        type            calculated;
        value           uniform 1.225;
    }
}

// ************************************************************************* //
