constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
	{
		type            heRhoThermo;
		mixture         pureMixture;
		transport       const;
		thermo          hConst;
		equationOfState Boussinesq;
		specie          specie;
		energy          sensibleEnthalpy;
	}

	mixture
	{
		specie
		{
			molWeight       28.9;
		}
		thermodynamics
		{
			Cp              1003.5;
			Hf              0;
		}
		transport
		{
			mu              1.8e-05;
			Pr              0.7;
		}
		equationOfState
		{
			rho0            1.225;
			T0              300;
			beta            5e-5; //1e-4; //3e-03;
		}
	}

// ************************************************************************* //