system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)				//Vertex 0
    (18.5 0 0)			//Vertex 1
    (18.5 2.1 0)		//Vertex 2
    (0 2.1 0)			//Vertex 3
    (0 0 3)				//Vertex 4
    (18.5 0 3)			//Vertex 5
    (18.5 2.1 3)		//Vertex 6
    (0 2.1 3)			//Vertex 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (370 42 60) simpleGrading (1 ((0.5 0.5 5)(0.5 0.5 0.2)) ((0.5 0.5 5)(0.5 0.5 0.2)))
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
	inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)                       
        );
    }
	outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //