system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     mybuoyantBoussinesqSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

adjustTimeStep  yes;

maxCo           0.3; // Reduce el número de Courant máximo permitido

maxDeltaT       0.005; // Limita el paso de tiempo máximo

deltaT          1;

writeControl    timeStep;

writeInterval   10;// 100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


libs            
(
	"USource.so"
	"kSource.so"
	"epsilonSource.so"
	"ESource.so"
	"specHumSource.so"
	//"atmosphericModels"
);


functions
 {
     GLeaf
     {
         type GLeaf;
         libs ("GLeaf.so");
         executeControl      timeStep;
         executeInterval     1;
         writeControl        writeTime;
 		//region air;
		
     }

     TLeaf
     {
         type TLeaf;
         libs ("TLeaf.so");
         executeControl      timeStep;
         executeInterval     1;
         writeControl        writeTime;
	//region air;
     }
 }

functions
{
    #includeFunc yPlus
}
// ************************************************************************* //