system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default Gauss linear limited 0.5; //default         Gauss linear;
}

divSchemes
{
    default         					none;
    
    div(phi,U)         					Gauss upwind;
    div(phi,h)          				Gauss upwind;
    div(phi,specHum) 					Gauss upwind; //bounded Gauss upwind;
	div(phi,k)          				Gauss upwind;
    div(phi,epsilon)    				Gauss upwind;
    div(phi,R)          				Gauss upwind;
    div(R)              				Gauss linear;
	div(phi,T)          				Gauss upwind; //Gauss linear;
    div(Ji,Ii_h)        				Gauss linearUpwind grad(U);    
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
	div((nuEff*dev2(T(grad(U))))) 		Gauss linear;
}

laplacianSchemes
{
    default         					Gauss linear corrected;
	//laplacian(alphaEff,T) 			Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         					linear;
}

snGradSchemes
{
    default         					corrected;
}


// ************************************************************************* //
