system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }
	
	p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;  // Más precisión en presión
        relTol          0.005; // Menos tolerante a errores
    }
	
	//p
	//{
	//	solver GAMG;
	//	smoother GaussSeidel;
	//	tolerance 1e-7;
	//	relTol 0.05;
	//}
	
	
	p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|k|epsilon|R|specHum)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.1;
    }

    Ii
    {
        solver              GAMG;
        tolerance           1e-4;
        relTol              0.1;
        smoother            symGaussSeidel;
        maxIter             10;
        nPostSweeps         1;
    }
	
	T
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }
}

SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0; //100000;
    rhoMin          0.8; // 0.2;
    rhoMax          1.5;// 2;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.3; //0.7;
        rho             0.8; //1.0;
		T       		0.3;
    }
    equations
    {
        U               0.5; //0.3;
        h               0.7; //0.5;
        G               0.5;
        specHum         0.5;
        "(k|epsilon|R)" 0.7;
        "ILambda.*"     0.7;
        qr              0.5;
    }
}


// ************************************************************************* //